# Initial Setup

In [4]:
import os

import duckdb
import streamlit as st

In [3]:
con = duckdb.connect(database='duckdb/blood_donation_pipeline_v2.duckdb')

In [11]:
download_dir = "load"

for files in os.listdir(download_dir):
    table_name = files.split(".")[0].replace("-", "_")
    file_path = os.path.join(download_dir, files)
    query = f"""
    CREATE OR REPLACE TABLE {table_name} AS
    SELECT * FROM '{file_path}'
    """
    con.execute(query)
    print(f"created table {table_name}")

created table donations_facility
created table donations_state
created table ds_data_granular
created table newdonors_facility
created table newdonors_state

In [14]:
query = """
SELECT * FROM donations_facility LIMIT 5;
"""
con.execute(query).df()
# donations by hospital by blood_[type] 
# donations by hospital by social_[type]
# donations by hospital by donations_[frequency]

,date,hospital,daily,blood_a,blood_b,blood_o,blood_ab,location_centre,location_mobile,type_wholeblood,type_apheresis_platelet,type_apheresis_plasma,type_other,social_civilian,social_student,social_policearmy,donations_new,donations_regular,donations_irregular
0,2006-01-01,Hospital Sultanah Nora Ismail,87,19,20,45,3,87,0,87,0,0,0,86,1,0,36,49,2
1,2006-01-01,Hospital Sultanah Aminah,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
2,2006-01-01,Hospital Sultanah Bahiyah,208,67,62,61,18,208,0,208,0,0,0,197,8,3,1,207,0
3,2006-01-01,Hospital Raja Perempuan Zainab II,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
4,2006-01-01,Hospital Melaka,1,0,0,1,0,1,0,1,0,0,0,1,0,0,0,1,0

In [15]:
query = """
SELECT * FROM donations_state LIMIT 5;
"""
con.execute(query).df()
# donations by state by blood_[type] 
# donations by state by social_[type]
# donations by state by donations_[frequency]

,date,state,daily,blood_a,blood_b,blood_o,blood_ab,location_centre,location_mobile,type_wholeblood,type_apheresis_platelet,type_apheresis_plasma,type_other,social_civilian,social_student,social_policearmy,donations_new,donations_regular,donations_irregular
0,2006-01-01,Malaysia,525,152,139,194,40,308,217,525,0,0,0,496,18,11,243,277,5
1,2006-01-02,Malaysia,227,53,43,112,19,162,65,217,6,4,0,224,2,1,83,143,1
2,2006-01-03,Malaysia,112,29,21,56,6,112,0,89,10,13,0,105,2,5,8,101,3
3,2006-01-04,Malaysia,391,92,98,165,36,145,246,371,4,16,0,316,71,4,286,102,3
4,2006-01-05,Malaysia,582,149,198,193,42,371,211,548,17,17,0,555,19,8,328,250,4

In [16]:
query = """
SELECT * FROM newdonors_facility LIMIT 5;
"""
con.execute(query).df()
# donations by hospital by age group

,date,hospital,17-24,25-29,30-34,35-39,40-44,45-49,50-54,55-59,60-64,other,total
0,2006-01-01,Hospital Sultanah Nora Ismail,21,2,2,3,6,1,0,0,1,0,36
1,2006-01-01,Hospital Sultanah Aminah,0,0,0,0,0,0,0,0,0,0,0
2,2006-01-01,Hospital Sultanah Bahiyah,0,0,0,1,0,0,0,0,0,0,1
3,2006-01-01,Hospital Raja Perempuan Zainab II,0,0,0,0,0,0,0,0,0,0,0
4,2006-01-01,Hospital Melaka,0,0,0,0,0,0,0,0,0,0,0

In [17]:
query = """
SELECT * FROM newdonors_state LIMIT 5;
"""
con.execute(query).df()
# donations by state by age group

,date,state,17-24,25-29,30-34,35-39,40-44,45-49,50-54,55-59,60-64,other,total
0,2006-01-01,Malaysia,124,31,31,18,24,7,5,2,1,0,243
1,2006-01-02,Malaysia,16,15,11,8,19,6,6,2,0,0,83
2,2006-01-03,Malaysia,1,2,1,2,1,0,0,1,0,0,8
3,2006-01-04,Malaysia,171,35,27,13,16,16,6,1,0,1,286
4,2006-01-05,Malaysia,219,41,22,13,16,8,8,1,0,0,328

In [19]:
query = """
SELECT * FROM ds_data_granular LIMIT 5;
"""
con.execute(query).df()
# calculate retention (how often they come back)
# calculate churn (when do they leave)
# calculate retention & churn rate by age

  donor_id visit_date  birth_date
0    00000 2013-11-03        1964
1    00000 2014-05-26        1964
2    00000 2015-01-25        1964
3    00000 2015-08-09        1964
4    00000 2016-03-10        1964